```terraform
Terraform will perform the following actions:

  # azurerm_federated_identity_credential.infracijenkinsio_agents_1_infra_ci_jenkins_io_agents will be created
  + resource "azurerm_federated_identity_credential" "infracijenkinsio_agents_1_infra_ci_jenkins_io_agents" {
      + audience                  = [
          + "api://AzureADTokenExchange",
        ]
      + id                        = (known after apply)
      + issuer                    = "https://eastus2.oic.prod-aks.azure.com/4c45fef2-1ba7-4120-80a0-9e2d03e9c2b6/624346c6-3512-4998-8733-420d7c0a3894/"
      + name                      = "infracijenkinsio-agents-1-jenkins-infra-agent"
      + parent_id                 = (known after apply)
      + resource_group_name       = (known after apply)
      + subject                   = "system:serviceaccount:jenkins-infra-agents:jenkins-infra-agent"
      + user_assigned_identity_id = "/subscriptions/dff2ec18-6a8e-405c-8e45-b7df7465acf0/resourceGroups/infra-ci-jenkins-io-controller/providers/Microsoft.ManagedIdentity/userAssignedIdentities/infra-ci-jenkins-io-agents"
    }

  # azurerm_kubernetes_cluster_node_pool.infracijenkinsio_agents_1_linux_arm64_agents_1 will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "infracijenkinsio_agents_1_linux_arm64_agents_1" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed/resourceGroups/infracijenkinsio-agents-1/providers/Microsoft.ContainerService/managedClusters/infracijenkinsio-agents-1"
      + max_count             = 20
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "la64agt1"
      + node_count            = (known after apply)
      + node_labels           = {
          + "jenkins"                               = "infra.ci.jenkins.io"
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "role"                                  = "jenkins-agents"
        }
      + node_taints           = [
          + "infra.ci.jenkins.io/agents=true:NoSchedule",
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = "1.33.5"
      + os_disk_size_gb       = 430
      + os_disk_type          = "Ephemeral"
      + os_sku                = "AzureLinux"
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "repository" = "jenkins-infra/azure"
          + "scope"      = "terraform-managed"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D16pds_v6"
      + vnet_subnet_id        = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed/resourceGroups/infra-ci-jenkins-io-sponsored/providers/Microsoft.Network/virtualNetworks/infra-ci-jenkins-io-sponsored-vnet/subnets/infra-ci-jenkins-io-sponsored-vnet-kubernetes-agents"
      + zones                 = [
          + "1",
          + "2",
        ]
    }

  # azurerm_kubernetes_cluster_node_pool.infracijenkinsio_agents_1_linux_x86_64_agents_1 will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "infracijenkinsio_agents_1_linux_x86_64_agents_1" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed/resourceGroups/infracijenkinsio-agents-1/providers/Microsoft.ContainerService/managedClusters/infracijenkinsio-agents-1"
      + max_count             = 20
      + max_pods              = (known after apply)
      + min_count             = 0
      + mode                  = "User"
      + name                  = "lx86agt1"
      + node_count            = (known after apply)
      + node_labels           = {
          + "jenkins"                               = "infra.ci.jenkins.io"
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "role"                                  = "jenkins-agents"
        }
      + node_taints           = [
          + "infra.ci.jenkins.io/agents=true:NoSchedule",
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = "1.33.5"
      + os_disk_size_gb       = 430
      + os_disk_type          = "Ephemeral"
      + os_sku                = "AzureLinux"
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "repository" = "jenkins-infra/azure"
          + "scope"      = "terraform-managed"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D8ads_v7"
      + vnet_subnet_id        = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed/resourceGroups/infra-ci-jenkins-io-sponsored/providers/Microsoft.Network/virtualNetworks/infra-ci-jenkins-io-sponsored-vnet/subnets/infra-ci-jenkins-io-sponsored-vnet-kubernetes-agents"
      + zones                 = [
          + "2",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```